const clothes = [
  {
    id: '1',
    title: 'تیشرت مردانه',
    price: '100000',
    image: '/images/clothes/t-1.jpg',
    description:
      'دارای یقه گرد و آستین کوتاه و پارچه ساده می باشد. دارای طرح پرسی حرارتی و سابليميشن در قسمت جلوهست. مناسب استفاده روزمره است. تهيه شده از 100 درصد الياف نخی يک رو پنبه است. دارای کيفيت دوخت با استاندارد جهانی است',
    prodCatagory: 'clothes',
    rating: 80,
  },
  {
    id: '2',
    title: 'تیشرت مردانه',
    price: '200000',
    image: '/images/clothes/t-2.jpg',
    description:
      'دارای یقه گرد و آستین کوتاه و پارچه ساده می باشد. دارای طرح پرسی حرارتی و سابليميشن در قسمت جلوهست. مناسب استفاده روزمره است. تهيه شده از 100 درصد الياف نخی يک رو پنبه است. دارای کيفيت دوخت با استاندارد جهانی است',
    prodCatagory: 'clothes',
    rating: 30,
  },
  {
    id: '3',
    title: 'تیشرت مردانه',
    price: '350000',
    image: '/images/clothes/t-3.jpg',
    description:
      'دارای یقه گرد و آستین کوتاه و پارچه ساده می باشد. دارای طرح پرسی حرارتی و سابليميشن در قسمت جلوهست. مناسب استفاده روزمره است. تهيه شده از 100 درصد الياف نخی يک رو پنبه است. دارای کيفيت دوخت با استاندارد جهانی است',
    prodCatagory: 'clothes',
    rating: 75,
  },
  {
    id: '4',
    title: 'سویشرت مردانه',
    price: '75000',
    image: '/images/clothes/s-1.jpg',
    description:
      'سویشرت همراه شما در روز های سرد سال می باشد.درفصل پاییز و زمستان گزینه مناسبی هنگام اسکی ، فعالیت روزانه و حتی در منزل می باشد.این هودی از پارچه دورس داخل کرک دوخته شده می باشد، در بافت پارچه دورس ترکیبی از نخ پنبه و نخ پلی استر به کار رفته است.این هودی دارای یک جیب دوطرفه در وسط و کلاه بند دار است.در سر آستین ها و قسمت کمر از کش استفاده شده تا از ورود سرما از این قسمت ها جلوگیری شده و سویشرت با فرم بهتری روی بدن قرار بگیرد و همینطور به علت داشتن الیاف پلی‌استر بسیار سبک، لطیف و راحت می باشد و مقاومت بالایی نیز در برابر ساییدگی ناشی از شستشو و استفاده‌های مکرر دارد',
    prodCatagory: 'clothes',
    rating: 81,
  },
  {
    id: '5',
    title: 'سویشرت مردانه',
    price: '105000',
    image: '/images/clothes/s-2.jpg',
    description:
      'سویشرت همراه شما در روز های سرد سال می باشد.درفصل پاییز و زمستان گزینه مناسبی هنگام اسکی ، فعالیت روزانه و حتی در منزل می باشد.این هودی از پارچه دورس داخل کرک دوخته شده می باشد، در بافت پارچه دورس ترکیبی از نخ پنبه و نخ پلی استر به کار رفته است.این هودی دارای یک جیب دوطرفه در وسط و کلاه بند دار است.در سر آستین ها و قسمت کمر از کش استفاده شده تا از ورود سرما از این قسمت ها جلوگیری شده و سویشرت با فرم بهتری روی بدن قرار بگیرد و همینطور به علت داشتن الیاف پلی‌استر بسیار سبک، لطیف و راحت می باشد و مقاومت بالایی نیز در برابر ساییدگی ناشی از شستشو و استفاده‌های مکرر دارد',
    prodCatagory: 'clothes',
    rating: 50,
  },
  {
    id: '6',
    title: 'سویشرت مردانه',
    price: '75000',
    image: '/images/clothes/s-3.jpg',
    description:
      'سویشرت همراه شما در روز های سرد سال می باشد.درفصل پاییز و زمستان گزینه مناسبی هنگام اسکی ، فعالیت روزانه و حتی در منزل می باشد.این هودی از پارچه دورس داخل کرک دوخته شده می باشد، در بافت پارچه دورس ترکیبی از نخ پنبه و نخ پلی استر به کار رفته است.این هودی دارای یک جیب دوطرفه در وسط و کلاه بند دار است.در سر آستین ها و قسمت کمر از کش استفاده شده تا از ورود سرما از این قسمت ها جلوگیری شده و سویشرت با فرم بهتری روی بدن قرار بگیرد و همینطور به علت داشتن الیاف پلی‌استر بسیار سبک، لطیف و راحت می باشد و مقاومت بالایی نیز در برابر ساییدگی ناشی از شستشو و استفاده‌های مکرر دارد',
    prodCatagory: 'clothes',
    rating: 32,
  },
  {
    id: '7',
    title: 'کاپشن مردانه',
    price: '1000000',
    image: '/images/clothes/c-1.jpg',
    description:
      'یکی از دلایل اینکه عده ای از فصل پاییز و زمستان گریزانند سرمای سخت و طاقت فرسای این فصول است که آن هم به راحتی قابل حل است و به جای اینکه به اشتباه سراغ پوشیدن انواع گوناگونی از لباس بروید بهتر است یک کاپشن راحت و گرم را برای آشتی با فصول سرد سال انتخاب کنید. حالا که سخن از خرید کاپشن به میان آمد بهتر است سری به معنی لغوی آن بزنیم و ماهیت این نوع کُت را مطرح کنیم. لغت «کاپشن» از زبان روسی وارد زبان فارسی شده است و در زبان انگلیسی با عنوان «Jacket» یا «Winter Coat» شناخته می‌شود. در تعریفی ساده، کاپشن نوعی کُت زمستانی است که معمولا کلاه دارد و برای گرم نگه‌داشتن بالاتنه و سر استفاده می‌شود. این نوع پوشش در گذشته بیشتر از جنس چرم بود و امروزه از الیاف مصنوعی مانند پلی‌استر و نایلون هم تولید می‌شود.',
    prodCatagory: 'clothes',
    rating: 70,
  },
  {
    id: '8',
    title: 'کاپشن مردانه',
    price: '850000',
    image: '/images/clothes/c-2.jpg',
    description:
      'یکی از دلایل اینکه عده ای از فصل پاییز و زمستان گریزانند سرمای سخت و طاقت فرسای این فصول است که آن هم به راحتی قابل حل است و به جای اینکه به اشتباه سراغ پوشیدن انواع گوناگونی از لباس بروید بهتر است یک کاپشن راحت و گرم را برای آشتی با فصول سرد سال انتخاب کنید. حالا که سخن از خرید کاپشن به میان آمد بهتر است سری به معنی لغوی آن بزنیم و ماهیت این نوع کُت را مطرح کنیم. لغت «کاپشن» از زبان روسی وارد زبان فارسی شده است و در زبان انگلیسی با عنوان «Jacket» یا «Winter Coat» شناخته می‌شود. در تعریفی ساده، کاپشن نوعی کُت زمستانی است که معمولا کلاه دارد و برای گرم نگه‌داشتن بالاتنه و سر استفاده می‌شود. این نوع پوشش در گذشته بیشتر از جنس چرم بود و امروزه از الیاف مصنوعی مانند پلی‌استر و نایلون هم تولید می‌شود.',
    prodCatagory: 'clothes',
    rating: 65,
  },
];

export const getAllClothes = () => clothes;
export const getSliderClothes = () => clothes.slice(0, 4);
export const getClothById = (id) => clothes.find((cloth) => cloth.id === id);

const watches = [
  {
    id: '11',
    title: 'ساعت مچی',
    price: '1500000',
    image: '/images/watches/w-1.jpg',
    description:
      'ازآنجایی‌که ساعت مچی یکی از پرکاربردترین اکسسوری ها برای آقایان است از اهمیت ویژه‌ای درمیان آقایان خوش استایل برخوردار است. امروزه برندهای بسیار متنوع در بازار به ساخت و طراحی ساعت مچی برای آقایان می‌پردازند. برای خرید ساعت مردانه باید به استایل پوششی خود و هم‌چنین مکانی که قصد استفاده از ساعت مچی خود را دارید توجه کنید، زیرا تنوع بالای طراحی‌های ساعت مچی محب شده برای هر استایل و هر مناسبت خوش استایل ها از ساعت‌های مختلف استفاده کنند برای اینکه بهترین انتخاب را در خرید ساعت مردانه داشته باشید با ما همراه باشید.',
    prodCatagory: 'watches',
    rating: 95,
  },
  {
    id: '12',
    title: 'ساعت مچی',
    price: '3500000',
    image: '/images/watches/w-2.jpg',
    description:
      'ازآنجایی‌که ساعت مچی یکی از پرکاربردترین اکسسوری ها برای آقایان است از اهمیت ویژه‌ای درمیان آقایان خوش استایل برخوردار است. امروزه برندهای بسیار متنوع در بازار به ساخت و طراحی ساعت مچی برای آقایان می‌پردازند. برای خرید ساعت مردانه باید به استایل پوششی خود و هم‌چنین مکانی که قصد استفاده از ساعت مچی خود را دارید توجه کنید، زیرا تنوع بالای طراحی‌های ساعت مچی محب شده برای هر استایل و هر مناسبت خوش استایل ها از ساعت‌های مختلف استفاده کنند برای اینکه بهترین انتخاب را در خرید ساعت مردانه داشته باشید با ما همراه باشید.',
    prodCatagory: 'watches',
    rating: 25,
  },
  {
    id: '13',
    title: 'ساعت مچی',
    price: '950000',
    image: '/images/watches/w-3.jpg',
    description:
      'ازآنجایی‌که ساعت مچی یکی از پرکاربردترین اکسسوری ها برای آقایان است از اهمیت ویژه‌ای درمیان آقایان خوش استایل برخوردار است. امروزه برندهای بسیار متنوع در بازار به ساخت و طراحی ساعت مچی برای آقایان می‌پردازند. برای خرید ساعت مردانه باید به استایل پوششی خود و هم‌چنین مکانی که قصد استفاده از ساعت مچی خود را دارید توجه کنید، زیرا تنوع بالای طراحی‌های ساعت مچی محب شده برای هر استایل و هر مناسبت خوش استایل ها از ساعت‌های مختلف استفاده کنند برای اینکه بهترین انتخاب را در خرید ساعت مردانه داشته باشید با ما همراه باشید.',
    prodCatagory: 'watches',
    rating: 20,
  },
  {
    id: '14',
    title: 'ساعت مچی',
    price: '1200000',
    image: '/images/watches/w-4.jpg',
    description:
      'ازآنجایی‌که ساعت مچی یکی از پرکاربردترین اکسسوری ها برای آقایان است از اهمیت ویژه‌ای درمیان آقایان خوش استایل برخوردار است. امروزه برندهای بسیار متنوع در بازار به ساخت و طراحی ساعت مچی برای آقایان می‌پردازند. برای خرید ساعت مردانه باید به استایل پوششی خود و هم‌چنین مکانی که قصد استفاده از ساعت مچی خود را دارید توجه کنید، زیرا تنوع بالای طراحی‌های ساعت مچی محب شده برای هر استایل و هر مناسبت خوش استایل ها از ساعت‌های مختلف استفاده کنند برای اینکه بهترین انتخاب را در خرید ساعت مردانه داشته باشید با ما همراه باشید.',
    prodCatagory: 'watches',
    rating: 65,
  },
  {
    id: '15',
    title: 'ساعت مچی',
    price: '2000000',
    image: '/images/watches/w-5.jpg',
    description:
      'ازآنجایی‌که ساعت مچی یکی از پرکاربردترین اکسسوری ها برای آقایان است از اهمیت ویژه‌ای درمیان آقایان خوش استایل برخوردار است. امروزه برندهای بسیار متنوع در بازار به ساخت و طراحی ساعت مچی برای آقایان می‌پردازند. برای خرید ساعت مردانه باید به استایل پوششی خود و هم‌چنین مکانی که قصد استفاده از ساعت مچی خود را دارید توجه کنید، زیرا تنوع بالای طراحی‌های ساعت مچی محب شده برای هر استایل و هر مناسبت خوش استایل ها از ساعت‌های مختلف استفاده کنند برای اینکه بهترین انتخاب را در خرید ساعت مردانه داشته باشید با ما همراه باشید.',
    prodCatagory: 'watches',
    rating: 70,
  },
  {
    id: '16',
    title: 'ساعت مچی',
    price: '2300000',
    image: '/images/watches/w-6.jpg',
    description:
      'ازآنجایی‌که ساعت مچی یکی از پرکاربردترین اکسسوری ها برای آقایان است از اهمیت ویژه‌ای درمیان آقایان خوش استایل برخوردار است. امروزه برندهای بسیار متنوع در بازار به ساخت و طراحی ساعت مچی برای آقایان می‌پردازند. برای خرید ساعت مردانه باید به استایل پوششی خود و هم‌چنین مکانی که قصد استفاده از ساعت مچی خود را دارید توجه کنید، زیرا تنوع بالای طراحی‌های ساعت مچی محب شده برای هر استایل و هر مناسبت خوش استایل ها از ساعت‌های مختلف استفاده کنند برای اینکه بهترین انتخاب را در خرید ساعت مردانه داشته باشید با ما همراه باشید.',
    prodCatagory: 'watches',
    rating: 40,
  },
  {
    id: '17',
    title: 'ساعت مچی',
    price: '1600000',
    image: '/images/watches/w-7.jpg',
    description:
      'ازآنجایی‌که ساعت مچی یکی از پرکاربردترین اکسسوری ها برای آقایان است از اهمیت ویژه‌ای درمیان آقایان خوش استایل برخوردار است. امروزه برندهای بسیار متنوع در بازار به ساخت و طراحی ساعت مچی برای آقایان می‌پردازند. برای خرید ساعت مردانه باید به استایل پوششی خود و هم‌چنین مکانی که قصد استفاده از ساعت مچی خود را دارید توجه کنید، زیرا تنوع بالای طراحی‌های ساعت مچی محب شده برای هر استایل و هر مناسبت خوش استایل ها از ساعت‌های مختلف استفاده کنند برای اینکه بهترین انتخاب را در خرید ساعت مردانه داشته باشید با ما همراه باشید.',
    prodCatagory: 'watches',
    rating: 55,
  },
];

export const getAllWatches = () => watches;
export const getSliderWatches = () => watches.slice(0, 4);
export const getWatchById = (id) => watches.find((watch) => watch.id === id);
